[
    {
        "name": "react",
        "Installation": [
            {
                "Getting Started": "<h1>Getting Started</h1><h4>This page is an overview of the React documentation and related resources.</h4><p><b>React</b> is a JavaScript library for building user interfaces. Learn what React is all about on our homepage or in the tutorial.</p><h2>Try React</h2><p>React has been designed from the start for gradual adoption, and <b>you can use as little or as much React as you need.</b> Whether you want to get a taste of React, add some interactivity to a simple HTML page, or start a complex React-powered app, the links in this section will help you get started.</p><h3>Online Playgrounds</h3><p>If you’re interested in playing around with React, you can use an online code playground. Try a Hello World template on CodePen or CodeSandbox.</p><p>If you prefer to use your own text editor, you can also download this HTML file, edit it, and open it from the local filesystem in your browser. It does a slow runtime code transformation, so we’d only recommend using this for simple demos.</p><h3>Add React to a Website</h3><p>You can add React to an HTML page in one minute. You can then either gradually expand its presence, or keep it contained to a few dynamic widgets.</p><h3>Create a New React App</h3><p>When starting a React project, a simple HTML page with script tags might still be the best option. It only takes a minute to set up!</p><p>As your application grows, you might want to consider a more integrated setup. There are several JavaScript toolchains we recommend for larger applications. Each of them can work with little to no configuration and lets you take full advantage of the rich React ecosystem.</p>"
            }
        ],
        "Main Concepts": [
            {
                "Add React to a Website": "<h1>Add React to a Website</h1><h4>Use as little or as much React as you need.</h4><p>React has been designed from the start for gradual adoption, and <b>you can use as little or as much React as you need</b>. Perhaps you only want to add some “sprinkles of interactivity” to an existing page. React components are a great way to do that.</p><p>The majority of websites aren’t, and don’t need to be, single-page apps. With <b>a few lines of code and no build tooling</b> , try React in a small part of your website. You can then either gradually expand its presence, or keep it contained to a few dynamic widgets.</p><h2>Add React in One Minute</h2><p>There will be no complicated tools or install requirements — <b>to complete this section, you only need an internet connection, and a minute of your time</b>.</p><h3>Step 1: Add a DOM Container to the HTML</h3><p>First, open the HTML page you want to edit. Add an empty div tag to mark the spot where you want to display something with React. For example:</p>"
            }
        ]
    },
    {
        "name": "mongo",
        "Getting Started": "<h1>Getting Started</h1><p>The following tutorial uses the mongo shell to insert data and perform query operations.</p><h2>Prerequisites</h2><p>This tutorial requires you to be connected to one of the following:</p><ul> <li><b>MongoDB Atlas Free Tier Cluster</b>. MongoDB Atlas is a fast, easy, and free way to get started with MongoDB. Follow the Create an Atlas Free Tier Cluster tutorial to get started with MongoDB Atlas.</li><li><b>Local MongoDB installation</b>. For more information on installing MongoDB locally, see Install MongoDB.</li></ul><h2>Insert Documents</h2><p>db.collection.insertMany() can insert multiple documents into a collection. Pass an array of documents to the method.</p><p>The following example inserts new documents into the inventory collection:</p><p>insertMany() returns a document that includes the newly inserted documents _id field values. See the reference for an example.</p><p>Use db.collection.insertOne() to insert a single document.</p><p>For more information and examples, see Insert Documents in the CRUD section.</p><h2>Query Documents</h2><h3>Select All Documents</h3><p>To select all documents in the collection, pass an empty document as the query filter document to the db.collection.find() method:</p>"
    }
]